francescopace/esp32-microcsi/src/modwifi_csi.c
    // Copy CSI data
    frame.len = info->len > CSI_MAX_DATA_LEN ? CSI_MAX_DATA_LEN : info->len;
    if (info->buf && frame.len > 0) {
        memcpy(frame.data, info->buf, frame.len * sizeof(int16_t));
    }

    // Write to circular buffer
    csi_buffer_write(&g_csi_state.buffer, &frame);
}

// ============================================================================
// CSI Control Functions
// ============================================================================

void wifi_csi_init(void) {
    // Initialize with default configuration
    if (!g_csi_state.buffer.initialized) {
        csi_buffer_init(&g_csi_state.buffer, g_csi_state.config.buffer_size);
    }
}

void wifi_csi_deinit(void) {
    if (g_csi_state.enabled) {
        wifi_csi_disable();
    }
    csi_buffer_deinit(&g_csi_state.buffer);
}

esp_err_t wifi_csi_enable(void) {
    if (g_csi_state.enabled) {
        ESP_LOGI(TAG, "Already enabled");
        return ESP_OK;
    }

    esp_err_t ret;

    ESP_LOGI(TAG, "Starting CSI enable sequence...");

    // Ensure buffer is initialized
    if (!g_csi_state.buffer.initialized) {
        ESP_LOGI(TAG, "Initializing buffer (size=%lu)...", (unsigned long)g_csi_state.config.buffer_size);
        if (!csi_buffer_init(&g_csi_state.buffer, g_csi_state.config.buffer_size)) {
            ESP_LOGE(TAG, "Failed to initialize buffer");
            return ESP_ERR_NO_MEM;
        }
        ESP_LOGI(TAG, "Buffer initialized OK");
    }

    // Configure WiFi protocol mode
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5/C6: Enable WiFi 6 (802.11ax) for improved performance and CSI capture
    ret = esp_wifi_set_protocol(WIFI_IF_STA,
        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set WiFi protocol: 0x%x", ret);
    } else {
        ESP_LOGI(TAG, "WiFi protocol set to 802.11b/g/n/ax (WiFi 6 enabled)");
    }
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3: WiFi 4 only (802.11b/g/n)
    ret = esp_wifi_set_protocol(WIFI_IF_STA,
        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set WiFi protocol: 0x%x", ret);
    } else {
        ESP_LOGI(TAG, "WiFi protocol set to 802.11b/g/n");
    }
    #endif

    // Configure WiFi bandwidth (HT20 for stability)
    ret = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set bandwidth: 0x%x", ret);
    } else {
        ESP_LOGI(TAG, "WiFi bandwidth set to HT20 (20MHz)");
    }

    // IMPORTANT: For ESP32-C6, promiscuous mode MUST be called BEFORE configuring CSI
    // This initializes internal WiFi structures required for CSI, even when set to false
    ESP_LOGI(TAG, "Initializing promiscuous mode (false)...");
    ret = esp_wifi_set_promiscuous(false);
    ESP_LOGD(TAG, "esp_wifi_set_promiscuous returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set promiscuous mode");
        return ret;
    }
    ESP_LOGI(TAG, "Promiscuous mode: disabled (CSI from connected AP only)");

    #if CONFIG_IDF_TARGET_ESP32C6
    // ESP32-C6: Full WiFi 6 config with HE STBC support
    // Reference: https://github.com/espressif/esp-idf/issues/14271
    // CRITICAL: Must specify which CSI types to acquire, otherwise callback is never invoked!
    wifi_csi_config_t csi_config = {
        .enable = 1,                    // Master enable for CSI acquisition (REQUIRED)

        .acquire_csi_legacy = 1,        // Acquire L-LTF CSI from legacy 802.11a/g packets
                                        // CRITICAL: Required for CSI callback to be invoked!
                                        // Captures channel state from non-HT packets

        .acquire_csi_ht20 = 1,          // Acquire HT-LTF CSI from 802.11n HT20 packets
                                        // CRITICAL: Required for CSI from HT packets!
                                        // Provides improved channel estimation for MIMO

        .acquire_csi_ht40 = 0,          // Acquire HT-LTF CSI from 802.11n HT40 packets (40MHz bandwidth)
                                        // Disabled (using HT20 for stability)
                                        // Enable if router uses HT40 and you need 128 subcarriers

        .acquire_csi_su = 1,            // Acquire HE-LTF CSI from 802.11ax HE20 SU (Single-User) packets
                                        // Enabled for WiFi 6 support (if router supports 802.11ax)

        .acquire_csi_mu = 0,            // Acquire HE-LTF CSI from 802.11ax HE20 MU (Multi-User) packets
                                        // Disabled (not using WiFi 6 MU-MIMO)

        .acquire_csi_dcm = 0,           // Acquire CSI from DCM (Dual Carrier Modulation) packets
                                        // DCM is a WiFi 6 feature for long-range transmission
                                        // Disabled (not commonly used)

        .acquire_csi_beamformed = 0,    // Acquire CSI from beamformed packets
                                        // Beamforming directs signal toward receiver
                                        // Disabled (not needed for general CSI capture)

        .acquire_csi_he_stbc = 0,       // Acquire CSI from 802.11ax HE STBC packets
                                        // STBC improves reliability using multiple antennas
                                        // Disabled (not commonly used)

        .val_scale_cfg = 0,             // CSI value scaling configuration (0-8)
                                        // 0 = automatic scaling (recommended)
                                        // 1-8 = manual scaling with shift bits
                                        // Controls normalization of CSI amplitude values

        .dump_ack_en = 0,               // Enable capture of 802.11 ACK frames
                                        // Disabled to reduce overhead (ACK frames not needed)
    };
    #elif CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5: WiFi 6 config without HE STBC field
    // Note: ESP32-C5 has a slightly different wifi_csi_acquire_config_t structure
    wifi_csi_config_t csi_config = {
        .enable = 1,                    // Master enable for CSI acquisition (REQUIRED)

        .acquire_csi_legacy = 1,        // Acquire L-LTF CSI from legacy 802.11a/g packets
                                        // CRITICAL: Required for CSI callback to be invoked!

        .acquire_csi_ht20 = 1,          // Acquire HT-LTF CSI from 802.11n HT20 packets
                                        // CRITICAL: Required for CSI from HT packets!

        .acquire_csi_ht40 = 0,          // Acquire HT-LTF CSI from 802.11n HT40 packets (40MHz bandwidth)
                                        // Disabled (using HT20 for stability)

        .acquire_csi_su = 1,            // Acquire HE-LTF CSI from 802.11ax HE20 SU (Single-User) packets
                                        // Enabled for WiFi 6 support

        .acquire_csi_mu = 0,            // Acquire HE-LTF CSI from 802.11ax HE20 MU (Multi-User) packets
                                        // Disabled (not using WiFi 6 MU-MIMO)

        .acquire_csi_dcm = 0,           // Acquire CSI from DCM (Dual Carrier Modulation) packets
                                        // Disabled (not commonly used)

        .acquire_csi_beamformed = 0,    // Acquire CSI from beamformed packets
                                        // Disabled (not needed for general CSI capture)

