francescopace/esp32-microcsi/src/modwifi_csi.c
        // Note: acquire_csi_he_stbc field not available on ESP32-C5

        .val_scale_cfg = 0,             // CSI value scaling configuration (0-8)
                                        // 0 = automatic scaling (recommended)

        .dump_ack_en = 0,               // Enable capture of 802.11 ACK frames
                                        // Disabled to reduce overhead
    };
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3 use legacy CSI API with LTF fields
    wifi_csi_config_t csi_config = {
        .lltf_en = g_csi_state.config.lltf_en,           // Enable Legacy Long Training Field (L-LTF) CSI capture
                                                         // L-LTF is present in all 802.11a/g packets
                                                         // Provides base channel estimation (64 subcarriers)

        .htltf_en = g_csi_state.config.htltf_en,         // Enable HT Long Training Field (HT-LTF) CSI capture
                                                         // HT-LTF is present in 802.11n (HT) packets
                                                         // Provides improved channel estimation for MIMO

        .stbc_htltf2_en = g_csi_state.config.stbc_htltf2_en,  // Enable Space-Time Block Code HT-LTF2 capture
                                                              // STBC uses 2 antennas to improve reliability
                                                              // Captures second HT-LTF when STBC is active

        .ltf_merge_en = g_csi_state.config.ltf_merge_en,      // Merge L-LTF and HT-LTF data by averaging
                                                              // true: Average L-LTF and HT-LTF for HT packets (more stable)
                                                              // false: Use only HT-LTF for HT packets (more precise)

        .channel_filter_en = g_csi_state.config.channel_filter_en,  // Channel filter to smooth adjacent subcarriers
                                                                    // true: Filter/smooth adjacent subcarriers (52 useful)
                                                                    // false: Keep subcarrier independence (64 total)

        .manu_scale = g_csi_state.config.manu_scale,     // Manual vs automatic CSI data scaling
                                                         // false: Auto-scaling (recommended, adapts dynamically)
                                                         // true: Manual scaling (requires .shift parameter)

        .shift = g_csi_state.config.shift,               // Shift value for manual scaling (0-15)
                                                         // Only used when manu_scale = true

        .dump_ack_en = false,                             // Enable capture of 802.11 ACK frames
                                                          // Disabled to reduce overhead
    };
    #endif

    ESP_LOGI(TAG, "Setting CSI config...");
    ret = esp_wifi_set_csi_config(&csi_config);
    ESP_LOGD(TAG, "esp_wifi_set_csi_config returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set CSI config");
        return ret;
    }

    ESP_LOGI(TAG, "Registering CSI callback...");
    ret = esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, NULL);
    ESP_LOGD(TAG, "esp_wifi_set_csi_rx_cb returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register callback");
        return ret;
    }

    // Enable CSI LAST
    ESP_LOGI(TAG, "Calling esp_wifi_set_csi(true)...");
    ret = esp_wifi_set_csi(true);
    ESP_LOGD(TAG, "esp_wifi_set_csi returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable CSI (error code: 0x%x)", ret);
        return ret;
    }

    g_csi_state.enabled = true;

    #if CONFIG_IDF_TARGET_ESP32C6
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C6 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32C5
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C5 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32S3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S3 mode)");
    #elif CONFIG_IDF_TARGET_ESP32S2
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S2 mode)");
    #elif CONFIG_IDF_TARGET_ESP32C3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C3 mode)");
    #else
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32 mode)");
    #endif

    return ESP_OK;
}

esp_err_t wifi_csi_disable(void) {
    if (!g_csi_state.enabled) {
        return ESP_OK;
    }

    esp_err_t ret = esp_wifi_set_csi(false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to disable CSI: %d", ret);
        return ret;
    }

    // Disable promiscuous mode (optional - may be used by other parts of the system)
    // Only disable if we're sure nothing else needs it
    // esp_wifi_set_promiscuous(false);

    g_csi_state.enabled = false;
    ESP_LOGI(TAG, "CSI disabled");
    return ESP_OK;
}

esp_err_t wifi_csi_config(const csi_config_t *config) {
    if (config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    // Update configuration
    memcpy(&g_csi_state.config, config, sizeof(csi_config_t));

    // Reinitialize buffer if size changed
    if (config->buffer_size != g_csi_state.buffer.size) {
        bool was_enabled = g_csi_state.enabled;

        if (was_enabled) {
            wifi_csi_disable();
        }

        csi_buffer_deinit(&g_csi_state.buffer);
        if (!csi_buffer_init(&g_csi_state.buffer, config->buffer_size)) {
            return ESP_ERR_NO_MEM;
        }

        if (was_enabled) {
            return wifi_csi_enable();
        }
    } else if (g_csi_state.enabled) {
        // If already enabled, update configuration
        return wifi_csi_enable();
    }

    return ESP_OK;
}

bool wifi_csi_read_frame(csi_frame_t *frame) {
    return csi_buffer_read(&g_csi_state.buffer, frame);
}

// ============================================================================
// MicroPython Bindings
// ============================================================================

// wifi.csi.enable()
STATIC mp_obj_t wifi_csi_enable_py(mp_obj_t self_in) {
    esp_err_t ret = wifi_csi_enable();
    if (ret != ESP_OK) {
        mp_raise_OSError(ret);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(wifi_csi_enable_obj, wifi_csi_enable_py);

// wifi.csi.disable()
STATIC mp_obj_t wifi_csi_disable_py(mp_obj_t self_in) {
    esp_err_t ret = wifi_csi_disable();
    if (ret != ESP_OK) {
        mp_raise_OSError(ret);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(wifi_csi_disable_obj, wifi_csi_disable_py);

// wifi.csi.config(**kwargs)
STATIC mp_obj_t wifi_csi_config_obj(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    enum {
        ARG_lltf_en, ARG_htltf_en, ARG_stbc_htltf2_en, ARG_ltf_merge_en,
        ARG_channel_filter_en, ARG_manu_scale, ARG_shift, ARG_buffer_size
    };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_lltf_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true} },
        { MP_QSTR_htltf_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true} },
        { MP_QSTR_stbc_htltf2_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true} },
        { MP_QSTR_ltf_merge_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true} },
        { MP_QSTR_channel_filter_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true} },
        { MP_QSTR_manu_scale, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_shift, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_buffer_size, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CSI_DEFAULT_BUFFER_SIZE} },
    };

    mp_arg_val_t parsed_args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, parsed_args);

