francescopace/esp32-microcsi/src/modwifi_csi.c
    csi_config_t config = g_csi_state.config;

    config.lltf_en = parsed_args[ARG_lltf_en].u_bool;
    config.htltf_en = parsed_args[ARG_htltf_en].u_bool;
    config.stbc_htltf2_en = parsed_args[ARG_stbc_htltf2_en].u_bool;
    config.ltf_merge_en = parsed_args[ARG_ltf_merge_en].u_bool;
    config.channel_filter_en = parsed_args[ARG_channel_filter_en].u_bool;
    config.manu_scale = parsed_args[ARG_manu_scale].u_bool;
    config.shift = parsed_args[ARG_shift].u_int & 0x0F; // Limit to 0-15
    config.buffer_size = parsed_args[ARG_buffer_size].u_int;

    if (config.buffer_size < 1 || config.buffer_size > 1024) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer_size must be between 1 and 1024"));
    }

    esp_err_t ret = wifi_csi_config(&config);
    if (ret != ESP_OK) {
        mp_raise_OSError(ret);
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(wifi_csi_config_obj_obj, 1, wifi_csi_config_obj);

// wifi.csi.read() -> dict or None
STATIC mp_obj_t wifi_csi_read_obj(mp_obj_t self_in) {
    csi_frame_t frame;

    if (!wifi_csi_read_frame(&frame)) {
        return mp_const_none;
    }

    // Create dictionary for frame data
    mp_obj_t dict = mp_obj_new_dict(20);

    // Add metadata
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_rssi), mp_obj_new_int(frame.rssi));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_rate), mp_obj_new_int(frame.rate));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_sig_mode), mp_obj_new_int(frame.sig_mode));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_mcs), mp_obj_new_int(frame.mcs));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_cwb), mp_obj_new_int(frame.cwb));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_smoothing), mp_obj_new_int(frame.smoothing));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_not_sounding), mp_obj_new_int(frame.not_sounding));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_aggregation), mp_obj_new_int(frame.aggregation));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_stbc), mp_obj_new_int(frame.stbc));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_fec_coding), mp_obj_new_int(frame.fec_coding));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_sgi), mp_obj_new_int(frame.sgi));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_noise_floor), mp_obj_new_int(frame.noise_floor));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_ampdu_cnt), mp_obj_new_int(frame.ampdu_cnt));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_channel), mp_obj_new_int(frame.channel));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_secondary_channel), mp_obj_new_int(frame.secondary_channel));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_timestamp), mp_obj_new_int(frame.timestamp_us));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_local_timestamp), mp_obj_new_int(frame.local_timestamp));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_ant), mp_obj_new_int(frame.ant));
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_sig_len), mp_obj_new_int(frame.sig_len));

    // MAC address as bytes
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_mac),
        mp_obj_new_bytes(frame.mac, 6));

    // CSI data as array('h')
    mp_obj_array_t *csi_array = MP_OBJ_TO_PTR(mp_obj_new_bytearray_by_ref(
        frame.len * sizeof(int16_t), frame.data));
    csi_array->typecode = 'h';
    mp_obj_dict_store(dict, MP_OBJ_NEW_QSTR(MP_QSTR_data), MP_OBJ_FROM_PTR(csi_array));

    return dict;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(wifi_csi_read_obj_obj, wifi_csi_read_obj);

// wifi.csi.dropped() -> int
STATIC mp_obj_t wifi_csi_dropped_obj(mp_obj_t self_in) {
    return mp_obj_new_int(g_csi_state.buffer.dropped);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(wifi_csi_dropped_obj_obj, wifi_csi_dropped_obj);

// wifi.csi.available() -> int
STATIC mp_obj_t wifi_csi_available_obj(mp_obj_t self_in) {
    if (!g_csi_state.buffer.initialized) {
        return mp_obj_new_int(0);
    }

    uint32_t head = g_csi_state.buffer.head;
    uint32_t tail = g_csi_state.buffer.tail;
    uint32_t size = g_csi_state.buffer.size;

    uint32_t available = (head >= tail) ? (head - tail) : (size - tail + head);
    return mp_obj_new_int(available);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(wifi_csi_available_obj_obj, wifi_csi_available_obj);

// Local dictionary for CSI object
STATIC const mp_rom_map_elem_t wifi_csi_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_enable), MP_ROM_PTR(&wifi_csi_enable_obj) },
    { MP_ROM_QSTR(MP_QSTR_disable), MP_ROM_PTR(&wifi_csi_disable_obj) },
    { MP_ROM_QSTR(MP_QSTR_config), MP_ROM_PTR(&wifi_csi_config_obj_obj) },
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&wifi_csi_read_obj_obj) },
    { MP_ROM_QSTR(MP_QSTR_dropped), MP_ROM_PTR(&wifi_csi_dropped_obj_obj) },
    { MP_ROM_QSTR(MP_QSTR_available), MP_ROM_PTR(&wifi_csi_available_obj_obj) },
};
STATIC MP_DEFINE_CONST_DICT(wifi_csi_locals_dict, wifi_csi_locals_dict_table);

// CSI type definition
MP_DEFINE_CONST_OBJ_TYPE(
    wifi_csi_type,
    MP_QSTR_CSI,
    MP_TYPE_FLAG_NONE,
    locals_dict, &wifi_csi_locals_dict
    );

// CSI singleton instance
const mp_obj_base_t wifi_csi_singleton = { &wifi_csi_type };

#endif // MICROPY_PY_NETWORK_WLAN_CSI
